%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%名称：生成仿真数据
%日期：
%作用：通过对瞬时相位加权，增强方位估计
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

close all;
warning off
clear;
clc;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 设置各种参数 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%标志位flag（=1，使用真实数据，=2使用仿真数据）
flag=2;


T_total=3*60;           %采样总时间 3分钟*60s
fs=512;                 %采样频率   512  1024    2的倍数

T=5;                    %每段采样时间/s
N=fs*T;                 %每段采样点数

Num_N=T_total/T;        %总的采样段数目

f0 = fs/N*(0:N-1);      %fft变换后每一段频率

t=0:1/fs:T-1/fs;

%方便角度转换
deread=pi/180;
redge=180/pi;

%两个信号频率
frequency=[40,50,60,70];

%两个角的入射角度
theta=[50,200];
%信噪比。
SNR=-5;
%方位估计精度
deltaSigma=1;

% 第一个目标添加线谱系数
p1_sx1=0.4;
p1_sx2=0.4;
% 第二个目标添加线谱系数
p2_sx1=0.4;
p2_sx2=0.4;

p_sx=[p1_sx1,p1_sx2,p2_sx1,p2_sx2];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%生成滤波器(生成目标信号滤波器)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%FIRLen：滤波器的阶数
%[wn1，wn2]：截止频率为采样率的一半，例如：15~200hz，对应fl/(fs/2),fh/(fs/2)
%hamming(FIRLen+1)：窗函数的长度应等于FIR 滤波器系数个数，即阶数 n+1。
fl=15;fh=200;
FIRLen=256;
Fir=fir1(FIRLen,[fl/(fs/2),fh/(fs/2)],hamming(FIRLen+1));

    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 生成仿真数据
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    
    Data=Aim_Signal(N,Num_N,t,frequency,theta,SNR,p_sx,Fir);
    
    ax_t=Data(:,1);      %第一列为vx
    ay_t=Data(:,2);      %第二列为vy
    az_t=Data(:,3);      %第三列为vz
    p_t=Data(:,4);       %第四列为声压

        
    
    figure
    plot(ax_t);
    figure
    plot(f0,abs(fft(ax_t)/N*2));
    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 保存均方根
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
A=Data;

fid3=fopen('C:\Users\LMY\Desktop\A\emulated_data.txt','wt');
[m,n]=size(A);
for i=1:1:m
    for j=1:1:n
        if j==n
            fprintf(fid3,'%g\n',A(i,j));
        else
            fprintf(fid3,'%g\t',A(i,j));
        end
    end
    disp(['存储了第',num2str(i),'行数据']);
end
fclose(fid3);

disp(['完成仿真数据生成',num2str(1)]);
    
    

